Opentrons/opentrons-modules/stm32-modules/thermocycler-gen2/firmware/motor_task/motor_hardware.c
/**
 * @file motor_hardware.c
 * @brief Implements motor hardware control code
 */
#include "firmware/motor_hardware.h"

#include <stdatomic.h>
#include <stdlib.h>  // for abs
#include <string.h>  // for memset

#include "FreeRTOS.h"
#include "firmware/motor_spi_hardware.h"
#include "stm32g4xx_hal.h"
#include "stm32g4xx_hal_tim.h"
#include "task.h"

#ifdef __cplusplus
extern "C" {
#endif  // __cplusplus

// ----------------------------------------------------------------------------
// Local definitions

#define SOLENOID_Port GPIOD
#define SOLENOID_Pin GPIO_PIN_8
#define LID_STEPPER_ENABLE_Port GPIOE
#define LID_STEPPER_RESET_Pin GPIO_PIN_12
#define LID_STEPPER_ENABLE_Pin GPIO_PIN_10
#define LID_STEPPER_FAULT_Pin GPIO_PIN_11
#define LID_STEPPER_CONTROL_Port GPIOA
#define LID_STEPPER_VREF_Pin GPIO_PIN_4
#define LID_STEPPER_DIR_Pin GPIO_PIN_1
#define LID_STEPPER_STEP_Pin GPIO_PIN_0
#define LID_STEPPER_VREF_CHANNEL DAC_CHANNEL_1
#define LID_STEPPER_STEP_Channel TIM_CHANNEL_1

/** Port for the lid closed optical switch.*/
#define LID_CLOSED_SWITCH_PORT (GPIOD)
/** Pin for the lid closed optical switch.*/
#define LID_CLOSED_SWITCH_PIN (GPIO_PIN_9)

/** Port for the lid open optical switch.*/
#define LID_OPEN_SWITCH_PORT (GPIOB)
/** Pin for the lid open optical switch.*/
#define LID_OPEN_SWITCH_PIN (GPIO_PIN_7)

/** Port for Seal Extension Limit Switch input.*/
#define SEAL_EXTENSION_SWITCH_PORT (GPIOD)
/** Pin for Seal Extension Limit Switch input.*/
#define SEAL_EXTENSION_SWITCH_PIN (GPIO_PIN_6)

/** Port for Seal Retraction Limit Switch input.*/
#define SEAL_RETRACTION_SWITCH_PORT (GPIOC)
/** Pin for Seal Retraction Limit Switch input.*/
#define SEAL_RETRACTION_SWITCH_PIN (GPIO_PIN_12)

/** Port for the Photointerrupt Enable line.*/
#define PHOTOINTERRUPT_ENABLE_PORT (GPIOE)
/** Pin for the photointerrupt enable line.*/
#define PHOTOINTERRUPT_ENABLE_PIN (GPIO_PIN_0)

/** Port for the step pulse pin.*/
#define SEAL_STEPPER_STEP_PORT (GPIOB)
/** Pin for the step pulse pin.*/
#define SEAL_STEPPER_STEP_PIN (GPIO_PIN_10)
/** Port for the step direction port.*/
#define SEAL_STEPPER_DIRECTION_PORT (GPIOB)
/** Pin for the step direction pin.*/
#define SEAL_STEPPER_DIRECTION_PIN (GPIO_PIN_11)
/** Port for the enable pin.*/
#define SEAL_STEPPER_ENABLE_PORT (GPIOE)
/** Pin for enable pin.*/
#define SEAL_STEPPER_ENABLE_PIN (GPIO_PIN_15)
/** Diag0 pin is used for error signals.*/
#define SEAL_STEPPER_DIAG0_PORT (GPIOD)
/** Diag0 pin is used for error signals.*/
#define SEAL_STEPPER_DIAG0_PIN (GPIO_PIN_3)
/** IRQ for the seal stepper diag0.*/
#define SEAL_STEPPER_DIAG0_IRQ (EXTI3_IRQn)
/** Diag1 pin is used for error signals.*/
#define SEAL_STEPPER_DIAG1_PORT (GPIOD)
/** Diag1 pin is used for error signals.*/
#define SEAL_STEPPER_DIAG1_PIN (GPIO_PIN_4)
/** IRQ for the seal stepper diag0.*/
#define SEAL_STEPPER_DIAG1_IRQ (EXTI4_IRQn)

/** Frequency of the driving clock for TIM6 is 170MHz.*/
#define TIM6_APB_FREQ (170000000)
/** Preload for APB to give a 10MHz clock.*/
#define TIM6_PRELOAD (16)
/** Calculated TIM6 period.*/
#define TIM6_PERIOD \
    (((TIM6_APB_FREQ / (TIM6_PRELOAD + 1)) / MOTOR_INTERRUPT_FREQ) - 1)

/**
 * @brief Calculates the frequency of ticks to get a Lid Motor RPM. The ratio
 * is 32000 Hz to 75 rpm, which reduces to 1280/3
 * @param[in] rpm The requested RPM
 * @return the frequency for the timer
 */
#define LID_RPM_TO_FREQ(rpm) ((rpm * 1280) / 3)

/** Above this speed, will get skipping */
#define LID_RPM_MAX (125)
/** Below this speed reduces torque */
#define LID_RPM_MIN (10)

// ----------------------------------------------------------------------------
// Local typedefs

typedef struct lid_hardware_struct {
    // Whether the lid motor is moving
    bool moving;
    // Direction the lid is moving
    bool direction;
    // Whether the current movement is an overdrive movement
    bool overdrive;
    // Current step count for the lid
    int32_t step_count;
    // Target step count for the lid
    int32_t step_target;
    // Timer for the lid motor
    TIM_HandleTypeDef timer;
    // DAC for lid current control
    DAC_HandleTypeDef dac;
} lid_hardware_t;

typedef struct seal_hardware_struct {
    // Whether the seal motor driver is enabled
    bool enabled;
    // Is there a movement in progress?
    bool moving;
    // Current direction of the seal stepper.
    // True = forwards, False = backwards
    bool direction;
    // Bool check for whether the next switch interrupt
    // should trigger a callback
    atomic_bool extension_switch_armed;
    // Bool check for whether the next switch interrupt
    // should trigger a callback
    atomic_bool retraction_switch_armed;
    // Timer handle for the seal stepper
    TIM_HandleTypeDef timer;
} seal_hardware_t;

typedef struct motor_hardware_struct {
    // Whether this driver has been initialized
    bool initialized;
    // Callback for completion of a lid stepper movement
    motor_hardware_callbacks callbacks;
    // Current status of the lid stepper
    lid_hardware_t lid_stepper;
    // Encapsulates seal motor information
    seal_hardware_t seal;
} motor_hardware_t;

// Local variables

static motor_hardware_t _motor_hardware = {
    .initialized = false,
    .callbacks = {.lid_stepper_complete = NULL,
                  .seal_stepper_tick = NULL,
                  .seal_stepper_error = NULL,
                  .seal_stepper_limit_switch = NULL},
    .lid_stepper = {.moving = false,
                    .direction = true,
                    .overdrive = false,
                    .step_count = 0,
                    .step_target = 0,
                    .timer = {0},
                    .dac = {0}},
    .seal = {.enabled = false,
             .moving = false,
             .direction = false,
             .extension_switch_armed = false,
             .retraction_switch_armed = false,
             .timer = {0}}};

enum RCC_FLAGS {
    // lse clock security system failure
    LSECSSD,  // = 0
    // brown out
    BORRST,  // = 1
    // option byte-loader reset
    OBLRST,  // = 2
    // pin reset
    PINRST,  // = 3
    // software reset
    SFTRST,  // = 4
    // independent watchdog
    IWDGRST,  // = 5
    // window watchdog
    WWDGRST,  // = 6
    // low power reset
    LPWRRST,  // = 7
};

// ----------------------------------------------------------------------------
// Local function declaration

static void init_motor_gpio(void);
void HAL_TIM_OC_MspInit(TIM_HandleTypeDef* htim);
static void init_dac1(DAC_HandleTypeDef* hdac);
static void init_tim2(TIM_HandleTypeDef* htim);
static void init_tim6(TIM_HandleTypeDef* htim);
static bool lid_active();
static void save_reset_reason();
uint16_t reset_reason;

// ----------------------------------------------------------------------------
// Public function implementation

void motor_hardware_setup(const motor_hardware_callbacks* callbacks) {
    save_reset_reason();
    configASSERT(callbacks != NULL);
    configASSERT(callbacks->lid_stepper_complete != NULL);
    configASSERT(callbacks->seal_stepper_tick != NULL);
    configASSERT(callbacks->seal_stepper_error != NULL);
    configASSERT(callbacks->seal_stepper_limit_switch != NULL);

    memcpy(&_motor_hardware.callbacks, callbacks,
           sizeof(_motor_hardware.callbacks));

    if (!_motor_hardware.initialized) {
        init_motor_gpio();
        init_dac1(&_motor_hardware.lid_stepper.dac);
        init_tim2(&_motor_hardware.lid_stepper.timer);
        init_tim6(&_motor_hardware.seal.timer);
        motor_spi_initialize();
    }

    motor_hardware_lid_stepper_reset();
    motor_hardware_set_seal_enable(false);

    _motor_hardware.initialized = true;
}

