Opentrons/opentrons-modules/stm32-modules/thermocycler-gen2/firmware/motor_task/motor_hardware.c
// PA0/PA1/PB10/PB11 = TIM2CH1/2/3/4 (all GPIO_AF1_TIM2)
// control via increment_step in motor_task.hpp?
// handle end switch IT start and stop
void motor_hardware_lid_stepper_start(int32_t steps, bool overdrive) {
    // check for fault
    _motor_hardware.lid_stepper.step_count = 0;
    // Multiply number of steps by 2 because the timer is in toggle mode (2
    // interrupts = 1 microstep)
    _motor_hardware.lid_stepper.step_target = abs(steps) * 2;
    // Set overdrive flag
    _motor_hardware.lid_stepper.overdrive = overdrive;

    // True = opening
    _motor_hardware.lid_stepper.direction = (steps > 0);
    if (steps > 0) {
        HAL_GPIO_WritePin(LID_STEPPER_CONTROL_Port, LID_STEPPER_DIR_Pin,
                          GPIO_PIN_SET);
    } else {
        HAL_GPIO_WritePin(LID_STEPPER_CONTROL_Port, LID_STEPPER_DIR_Pin,
                          GPIO_PIN_RESET);
    }

    HAL_TIM_OC_Start_IT(&_motor_hardware.lid_stepper.timer,
                        LID_STEPPER_STEP_Channel);
}

void motor_hardware_lid_stepper_stop() {
    HAL_TIM_OC_Stop_IT(&_motor_hardware.lid_stepper.timer,
                       LID_STEPPER_STEP_Channel);
}

void motor_hardware_lid_increment() {
    bool done = false;
    _motor_hardware.lid_stepper.step_count++;
    // Only check stop switches if this is NOT an overdrive
    if (!_motor_hardware.lid_stepper.overdrive) {
        if (_motor_hardware.lid_stepper.direction) {
            // Check if lid is open
            if (motor_hardware_lid_read_open()) {
                done = true;
            }
        } else {
            // Check if lid is closed
            if (motor_hardware_lid_read_closed()) {
                done = true;
            }
        }
    }

    // If the lid hit a limit switch,
    if (_motor_hardware.lid_stepper.step_count >
        (_motor_hardware.lid_stepper.step_target - 1)) {
        done = true;
    }

    if (done) {
        motor_hardware_lid_stepper_stop();
        _motor_hardware.callbacks.lid_stepper_complete();
    }
}

void motor_hardware_lid_stepper_set_dac(uint8_t dacval) {
    HAL_DAC_SetValue(&_motor_hardware.lid_stepper.dac, LID_STEPPER_VREF_CHANNEL,
                     DAC_ALIGN_8B_R, dacval);
}

bool motor_hardware_lid_stepper_check_fault(void) {
    return (HAL_GPIO_ReadPin(LID_STEPPER_ENABLE_Port, LID_STEPPER_FAULT_Pin) ==
            GPIO_PIN_RESET)
               ? true
               : false;
}

bool motor_hardware_lid_stepper_reset(void) {
    // if fault, try resetting
    if (motor_hardware_lid_stepper_check_fault()) {
        HAL_GPIO_WritePin(LID_STEPPER_ENABLE_Port, LID_STEPPER_RESET_Pin,
                          GPIO_PIN_RESET);
        vTaskDelay(pdMS_TO_TICKS(100));
        HAL_GPIO_WritePin(LID_STEPPER_ENABLE_Port, LID_STEPPER_RESET_Pin,
                          GPIO_PIN_SET);
    }
    // return false if fault persists
    return (motor_hardware_lid_stepper_check_fault() == true) ? false : true;
}

bool motor_hardware_lid_stepper_set_rpm(double rpm) {
    if (lid_active()) {
        return false;
    }
    if (rpm < LID_RPM_MIN || rpm > LID_RPM_MAX) {
        return false;
    }

    /* Compute TIM2 clock */
    uint32_t uwTimClock = HAL_RCC_GetPCLK1Freq();
    uint32_t uwPeriodValue = __HAL_TIM_CALC_PERIOD(
        uwTimClock, _motor_hardware.lid_stepper.timer.Init.Prescaler,
        LID_RPM_TO_FREQ(rpm));
    __HAL_TIM_SET_AUTORELOAD(&_motor_hardware.lid_stepper.timer, uwPeriodValue);

    return true;
}

bool motor_hardware_lid_read_closed(void) {
    return (HAL_GPIO_ReadPin(LID_CLOSED_SWITCH_PORT, LID_CLOSED_SWITCH_PIN) ==
            GPIO_PIN_RESET)
               ? true
               : false;
}

bool motor_hardware_lid_read_open(void) {
    return (HAL_GPIO_ReadPin(LID_OPEN_SWITCH_PORT, LID_OPEN_SWITCH_PIN) ==
            GPIO_PIN_SET)
               ? true
               : false;
}

bool motor_hardware_set_seal_enable(bool enable) {
    // Active low
    HAL_GPIO_WritePin(SEAL_STEPPER_ENABLE_PORT, SEAL_STEPPER_ENABLE_PIN,
                      (enable) ? GPIO_PIN_RESET : GPIO_PIN_SET);
    return true;
}

bool motor_hardware_set_seal_direction(bool direction) {
    _motor_hardware.seal.direction = direction;
    HAL_GPIO_WritePin(SEAL_STEPPER_DIRECTION_PORT, SEAL_STEPPER_DIRECTION_PIN,
                      direction ? GPIO_PIN_SET : GPIO_PIN_RESET);
    return true;
}

bool motor_hardware_start_seal_movement(void) {
    return HAL_TIM_Base_Start_IT(&_motor_hardware.seal.timer) == HAL_OK;
}

bool motor_hardware_stop_seal_movement(void) {
    return HAL_TIM_Base_Stop_IT(&_motor_hardware.seal.timer) == HAL_OK;
}

void motor_hardware_seal_interrupt(void) {
    _motor_hardware.callbacks.seal_stepper_tick();
}

void motor_hardware_seal_step_pulse(void) {
    HAL_GPIO_WritePin(SEAL_STEPPER_STEP_PORT, SEAL_STEPPER_STEP_PIN,
                      GPIO_PIN_SET);
    HAL_GPIO_WritePin(SEAL_STEPPER_STEP_PORT, SEAL_STEPPER_STEP_PIN,
                      GPIO_PIN_RESET);
}

void motor_hardware_solenoid_engage() {  // engage to clear/unlock sliding
                                         // locking plate
    // check to confirm lid closed before engaging solenoid
    HAL_GPIO_WritePin(SOLENOID_Port, SOLENOID_Pin, GPIO_PIN_SET);
}

void motor_hardware_solenoid_release() {
    HAL_GPIO_WritePin(SOLENOID_Port, SOLENOID_Pin, GPIO_PIN_RESET);
}

bool motor_hardware_seal_extension_switch_triggered() {
    // Active low - the switches pull to ground when triggered
    return (HAL_GPIO_ReadPin(SEAL_EXTENSION_SWITCH_PORT,
                             SEAL_EXTENSION_SWITCH_PIN) == GPIO_PIN_RESET)
               ? true
               : false;
}

bool motor_hardware_seal_retraction_switch_triggered() {
    // Active low - the switches pull to ground when triggered
    return (HAL_GPIO_ReadPin(SEAL_RETRACTION_SWITCH_PORT,
                             SEAL_RETRACTION_SWITCH_PIN) == GPIO_PIN_RESET)
               ? true
               : false;
}

void motor_hardware_seal_switch_interrupt() {
    if (__HAL_GPIO_EXTI_GET_IT(SEAL_EXTENSION_SWITCH_PIN) != 0x00u) {
        __HAL_GPIO_EXTI_CLEAR_IT(SEAL_EXTENSION_SWITCH_PIN);
        if (atomic_exchange(&_motor_hardware.seal.extension_switch_armed, 0)) {
            if (_motor_hardware.callbacks.seal_stepper_limit_switch != NULL) {
                _motor_hardware.callbacks.seal_stepper_limit_switch();
            }
        }
    }
    if (__HAL_GPIO_EXTI_GET_IT(SEAL_RETRACTION_SWITCH_PIN) != 0x00u) {
        __HAL_GPIO_EXTI_CLEAR_IT(SEAL_RETRACTION_SWITCH_PIN);
        if (atomic_exchange(&_motor_hardware.seal.retraction_switch_armed, 0)) {
            if (_motor_hardware.callbacks.seal_stepper_limit_switch != NULL) {
                _motor_hardware.callbacks.seal_stepper_limit_switch();
            }
        }
    }
}

void motor_hardware_seal_switch_set_extension_armed() {
    _motor_hardware.seal.extension_switch_armed = true;
}

void motor_hardware_seal_switch_set_retraction_armed() {
    _motor_hardware.seal.retraction_switch_armed = true;
}

void motor_hardware_seal_switch_set_disarmed() {
    _motor_hardware.seal.extension_switch_armed = false;
    _motor_hardware.seal.retraction_switch_armed = false;
}

uint16_t motor_hardware_reset_reason() { return reset_reason; }

// ----------------------------------------------------------------------------
// Local function implementation

/**
 * @brief GPIO Initialization Function
 * @param None
 * @retval None
 */
static void init_motor_gpio(void) {
    GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Enable GPIOx clocks */
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();
    __HAL_RCC_GPIOD_CLK_ENABLE();
    __HAL_RCC_GPIOE_CLK_ENABLE();

    GPIO_InitStruct.Pin = SOLENOID_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init(SOLENOID_Port, &GPIO_InitStruct);
    HAL_GPIO_WritePin(SOLENOID_Port, SOLENOID_Pin, GPIO_PIN_RESET);

