Opentrons/opentrons-modules/stm32-modules/thermocycler-gen2/firmware/motor_task/motor_hardware.c
    GPIO_InitStruct.Pin = LID_STEPPER_RESET_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init(LID_STEPPER_ENABLE_Port, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LID_STEPPER_ENABLE_Port, LID_STEPPER_RESET_Pin,
                      GPIO_PIN_SET);

    GPIO_InitStruct.Pin = LID_STEPPER_ENABLE_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    HAL_GPIO_Init(LID_STEPPER_ENABLE_Port, &GPIO_InitStruct);
    HAL_GPIO_WritePin(LID_STEPPER_ENABLE_Port, LID_STEPPER_ENABLE_Pin,
                      GPIO_PIN_RESET);  // enable output at init

    GPIO_InitStruct.Pin = LID_STEPPER_FAULT_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    HAL_GPIO_Init(LID_STEPPER_ENABLE_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LID_STEPPER_VREF_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(LID_STEPPER_CONTROL_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LID_STEPPER_DIR_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(LID_STEPPER_CONTROL_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LID_STEPPER_STEP_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Alternate = GPIO_AF1_TIM2;
    HAL_GPIO_Init(LID_STEPPER_CONTROL_Port, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LID_CLOSED_SWITCH_PIN;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(LID_CLOSED_SWITCH_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = LID_OPEN_SWITCH_PIN;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(LID_OPEN_SWITCH_PORT, &GPIO_InitStruct);

    // Initialize photointerrupt to 3.3v to enable
    GPIO_InitStruct.Pin = PHOTOINTERRUPT_ENABLE_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(PHOTOINTERRUPT_ENABLE_PORT, &GPIO_InitStruct);
    HAL_GPIO_WritePin(PHOTOINTERRUPT_ENABLE_PORT, PHOTOINTERRUPT_ENABLE_PIN,
                      GPIO_PIN_SET);

    GPIO_InitStruct.Pin = SEAL_STEPPER_ENABLE_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    GPIO_InitStruct.Alternate = 0;
    HAL_GPIO_Init(SEAL_STEPPER_ENABLE_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = SEAL_STEPPER_DIRECTION_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(SEAL_STEPPER_DIRECTION_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = SEAL_STEPPER_STEP_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(SEAL_STEPPER_STEP_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = SEAL_STEPPER_DIAG0_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(SEAL_STEPPER_DIAG0_PORT, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = SEAL_STEPPER_DIAG1_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(SEAL_STEPPER_DIAG1_PORT, &GPIO_InitStruct);

    // The IRQ for this line (EXTI 5 through 9) is enabled by
    // the thermal subsystem.
    GPIO_InitStruct.Pin = SEAL_EXTENSION_SWITCH_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_LOW;
    HAL_GPIO_Init(SEAL_EXTENSION_SWITCH_PORT, &GPIO_InitStruct);

    // The IRQ for this line (EXTI 10 through 15) is enabled by
    // the thermal subsystem.
    GPIO_InitStruct.Pin = SEAL_RETRACTION_SWITCH_PIN;
    HAL_GPIO_Init(SEAL_RETRACTION_SWITCH_PORT, &GPIO_InitStruct);

    HAL_NVIC_SetPriority(SEAL_STEPPER_DIAG0_IRQ, 4, 0);
    HAL_NVIC_EnableIRQ(SEAL_STEPPER_DIAG0_IRQ);

    HAL_NVIC_SetPriority(SEAL_STEPPER_DIAG1_IRQ, 4, 0);
    HAL_NVIC_EnableIRQ(SEAL_STEPPER_DIAG1_IRQ);
}

void HAL_TIM_OC_MspInit(TIM_HandleTypeDef* htim) {
    if (htim == &_motor_hardware.lid_stepper.timer) {
        /* Peripheral clock enable */
        __HAL_RCC_TIM2_CLK_ENABLE();

        /* TIM2 interrupt Init */
        HAL_NVIC_SetPriority(TIM2_IRQn, 6, 0);
        HAL_NVIC_EnableIRQ(TIM2_IRQn);
    }
}

static void init_dac1(DAC_HandleTypeDef* hdac) {
    HAL_StatusTypeDef hal_ret;

    __HAL_RCC_DAC1_CLK_ENABLE();
    hdac->Instance = DAC1;
    hdac->State = HAL_DAC_STATE_RESET;
    hal_ret = HAL_DAC_Init(hdac);
    configASSERT(hal_ret == HAL_OK);

    DAC_ChannelConfTypeDef chan_config = {
        .DAC_Trigger = DAC_TRIGGER_NONE,
        .DAC_OutputBuffer = DAC_OUTPUTBUFFER_ENABLE,
    };
    hal_ret =
        HAL_DAC_ConfigChannel(hdac, &chan_config, LID_STEPPER_VREF_CHANNEL);
    configASSERT(hal_ret == HAL_OK);
    hal_ret = HAL_DAC_Start(hdac, LID_STEPPER_VREF_CHANNEL);
    configASSERT(hal_ret == HAL_OK);
    hal_ret =
        HAL_DAC_SetValue(hdac, LID_STEPPER_VREF_CHANNEL, DAC_ALIGN_8B_R, 0);
    configASSERT(hal_ret == HAL_OK);
}

static void init_tim2(TIM_HandleTypeDef* htim) {
    HAL_StatusTypeDef hal_ret;
    TIM_OC_InitTypeDef htim_oc;
    configASSERT(htim != NULL);
    /* Compute TIM2 clock */
    uint32_t uwTimClock = HAL_RCC_GetPCLK1Freq();
    /* Compute the prescaler value to have TIM2 counter clock equal to 1MHz */
    uint32_t uwPrescalerValue = (uint32_t)((uwTimClock / 1000000U) - 1U);
    uint32_t uwPeriodValue = __HAL_TIM_CALC_PERIOD(uwTimClock, uwPrescalerValue,
                                                   LID_RPM_TO_FREQ(125));

    htim->Instance = TIM2;
    htim->Init.Prescaler = uwPrescalerValue;
    htim->Init.CounterMode = TIM_COUNTERMODE_UP;
    htim->Init.Period = uwPeriodValue;
    htim->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim->Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    htim->Channel = HAL_TIM_ACTIVE_CHANNEL_1;
    htim->State = HAL_TIM_STATE_RESET;
    hal_ret = HAL_TIM_OC_Init(htim);
    configASSERT(hal_ret == HAL_OK);

    htim_oc.OCMode = TIM_OCMODE_TOGGLE;
    htim_oc.OCPolarity = TIM_OCPOLARITY_HIGH;
    htim_oc.OCFastMode = TIM_OCFAST_DISABLE;
    htim_oc.OCIdleState = TIM_OCIDLESTATE_RESET;
    hal_ret =
        HAL_TIM_OC_ConfigChannel(htim, &htim_oc, LID_STEPPER_STEP_Channel);
    configASSERT(hal_ret == HAL_OK);
}

static void init_tim6(TIM_HandleTypeDef* htim) {
    HAL_StatusTypeDef hal_ret;
    TIM_MasterConfigTypeDef config = {0};
    configASSERT(htim != NULL);

    htim->Instance = TIM6;
    htim->Init.Prescaler = TIM6_PRELOAD;
    htim->Init.CounterMode = TIM_COUNTERMODE_UP;
    htim->Init.Period = TIM6_PERIOD;
    htim->Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    htim->State = HAL_TIM_STATE_RESET;
    hal_ret = HAL_TIM_Base_Init(htim);
    configASSERT(hal_ret == HAL_OK);

    config.MasterOutputTrigger = TIM_TRGO_RESET;
    config.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    hal_ret = HAL_TIMEx_MasterConfigSynchronization(htim, &config);
    configASSERT(hal_ret == HAL_OK);
}

