Opentrons/opentrons-modules/stm32-modules/thermocycler-gen2/firmware/motor_task/motor_hardware.c
static bool lid_active() {
    return TIM_CHANNEL_STATE_GET(&(_motor_hardware.lid_stepper.timer),
                                 LID_STEPPER_STEP_Channel) !=
           HAL_TIM_CHANNEL_STATE_READY;
}

static void save_reset_reason() {
    // check various reset flags to see if the HAL RCC
    // reset flag matches any of them
    reset_reason = 0;

    // lse clock security system failure
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_LSECSSD)) {
        reset_reason |= (1 << LSECSSD);
    }
    // brown out
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_BORRST)) {
        reset_reason |= (1 << BORRST);
    }
    // option byte-loader reset
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_OBLRST)) {
        reset_reason |= (1 << OBLRST);
    }
    // pin reset
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_PINRST)) {
        reset_reason |= (1 << PINRST);
    }
    // software reset
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_SFTRST)) {
        reset_reason |= (1 << SFTRST);
    }
    // independent watchdog
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_IWDGRST)) {
        reset_reason |= (1 << IWDGRST);
    }
    // window watchdog
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_WWDGRST)) {
        reset_reason |= (1 << WWDGRST);
    }
    // low power reset
    if (__HAL_RCC_GET_FLAG(RCC_FLAG_LPWRRST)) {
        reset_reason |= (1 << LPWRRST);
    }
}

// ----------------------------------------------------------------------------
// Overwritten HAL functions

/**
 * @brief This function handles TIM2 global interrupt (used for
 * Lid Stepper control)
 */
void TIM2_IRQHandler(void) {
    HAL_TIM_IRQHandler(&_motor_hardware.lid_stepper.timer);
}

/**
 * @brief This function handles TIM6 global interrupt.
 */
void TIM6_DAC_IRQHandler(void) {
    HAL_TIM_IRQHandler(&_motor_hardware.seal.timer);
}

/**
 * @brief Callback for the Diag0 input - falling edge.
 * This flags a seal stepper error event
 */
void EXTI3_IRQHandler(void) {
    if (__HAL_GPIO_EXTI_GET_IT(SEAL_STEPPER_DIAG0_PIN) != 0x00u) {
        __HAL_GPIO_EXTI_CLEAR_IT(SEAL_STEPPER_DIAG0_PIN);
        if (_motor_hardware.callbacks.seal_stepper_error) {
            _motor_hardware.callbacks.seal_stepper_error(MOTOR_ERROR);
        }
    }
}

/**
 * @brief Callback for the Diag1 input - falling edge.
 * This flags a seal stepper stall event.
 */
void EXTI4_IRQHandler(void) {
    if (__HAL_GPIO_EXTI_GET_IT(SEAL_STEPPER_DIAG1_PIN) != 0x00u) {
        __HAL_GPIO_EXTI_CLEAR_IT(SEAL_STEPPER_DIAG1_PIN);
        if (_motor_hardware.callbacks.seal_stepper_error) {
            _motor_hardware.callbacks.seal_stepper_error(MOTOR_STALL);
        }
    }
}

#ifdef __cplusplus
}  // extern "C"
#endif  // __cplusplus
